let v1 = [-0.5, 0.5, 0.5];
let v2 = [-0.5, -0.5, 0.5];

let v3 = [0.5, -0.5, 0.5];
let v4 = [0.5, 0.5, 0.5];

let v5 = [-0.5, 0.5, -0.5];
let v6 = [-0.5, -0.5, -0.5];

let v7 = [0.5, -0.5, -0.5];
let v8 = [0.5, 0.5, -0.5];

/*
  立方体定点颜色  
  因为webgl是两个三角形连着形成一个面，所以在坐标的时候要注意连着才行，
*/
export let positions = new Float32Array([
  ...v5,
  ...v6,
  ...v7,
  ...v8, // 前面
  ...v1,
  ...v2,
  ...v3,
  ...v4, // 后面
  ...v1,
  ...v4,
  ...v8,
  ...v5, // 左边
  ...v2,
  ...v3,
  ...v7,
  ...v6, // 右边
  ...v3,
  ...v4,
  ...v8,
  ...v7, // 上面
  ...v1,
  ...v2,
  ...v6,
  ...v5 // 下面
]);

// rgba颜色
let c1 = [1.0, 0.0, 0.0];
let c2 = [0.0, 1.0, 0.0];
let c3 = [0.0, 0.0, 1.0];
let c4 = [0.0, 1.0, 1.0];
let c5 = [1.0, 0.0, 1.0];
let c6 = [1.0, 1.0, 0.0];

// 相当于每个顶点需要一个颜色
export let colors = new Float32Array([
  ...c1,
  ...c1,
  ...c1,
  ...c1, //前面
  ...c2,
  ...c2,
  ...c2,
  ...c2, //后面
  ...c3,
  ...c3,
  ...c3,
  ...c3, //左面
  ...c4,
  ...c4,
  ...c4,
  ...c4, //右面
  ...c5,
  ...c5,
  ...c5,
  ...c5, //上面
  ...c6,
  ...c6,
  ...c6,
  ...c6 //下面
]);
